#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
data.google_compute_image.os_image: Reading...
google_compute_network.dedicated_vpc: Refreshing state... [id=projects/local-llm-test-486215/global/networks/llm-server-dev-vpc]
google_compute_router.nat_router[0]: Refreshing state... [id=projects/local-llm-test-486215/regions/us-east4/routers/llm-server-dev-nat-router]
google_compute_subnetwork.dedicated_subnet: Refreshing state... [id=projects/local-llm-test-486215/regions/us-east4/subnetworks/llm-subnet]
google_compute_firewall.spot_instance[0]: Refreshing state... [id=projects/local-llm-test-486215/global/firewalls/llm-server-dev-firewall]
data.google_compute_image.os_image: Read complete after 1s [id=projects/debian-cloud/global/images/debian-12-bookworm-v20260210]
google_compute_router_nat.nat[0]: Refreshing state... [id=local-llm-test-486215/us-east4/llm-server-dev-nat-router/llm-server-dev-nat]
google_compute_instance.spot_instance: Refreshing state... [id=projects/local-llm-test-486215/zones/us-east4-c/instances/llm-server-dev]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_instance.spot_instance must be replaced
-/+ resource "google_compute_instance" "spot_instance" {
      ~ cpu_platform              = "Intel Cascade Lake" -> (known after apply)
      ~ current_status            = "RUNNING" -> (known after apply)
      - enable_display            = false -> null
      ~ guest_accelerator         = [
          - {
              - count = 2
              - type  = "https://www.googleapis.com/compute/v1/projects/local-llm-test-486215/zones/us-east4-c/acceleratorTypes/nvidia-a100-80gb"
            },
        ] -> (known after apply)
      ~ id                        = "projects/local-llm-test-486215/zones/us-east4-c/instances/llm-server-dev" -> (known after apply)
      ~ instance_id               = "5392282377495038408" -> (known after apply)
      ~ label_fingerprint         = "4uGUxMjSLYY=" -> (known after apply)
      ~ metadata                  = {
          ~ "ssh-keys"               = "lgsok:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC+KzNnlthhnbq3KYdQHd3Gi2IhaDhf/CstBHWKlTHWc4g7fBf8Py1I9zx93CmwCXSTavJ+mHNx8eVMmOxu9f7IbKZMc2xNn+XSW3zIlSFafeEiHzHmyjDKoGvUUljDkPubdgA73AQzpPHiIhC4giEQzbFgZ6H+JXztjNS07oaZRuC+sraq7z7UfvGqYmQDInIAEU9NKK8Mo8WBOGyhs5/2yWCMXGF5pZAYDjV5uMe2PXpV8Ab+CMhVgTFOc/uRiWXmakNqbRsBNOa5kPJMJavW4Mm1Da45gQHR2qsrZxYh6tsq3sGTOA5bShibHNgE66OoAWvZHoR7COIpNuBra/7neknVbgOXZDBcAa7mv8DqCT0JnMuOVgbyqpjm+nete9CXSF+vIlmAvzPJbtALZRCJ+t947IocNOzEIMvDfNyz2JH+L4uMUbCWulyOCY9oNaSj5JnSFbefnXJGIaLopKbkVDA58DSxgS/W4slt8VnuCb+agMPEe546n1LIw7j6XHM= lgsok@LDNN19010A" -> ""
            # (2 unchanged elements hidden)
        }
      ~ metadata_fingerprint      = "xhHxTmD1DYs=" -> (known after apply)
      + min_cpu_platform          = (known after apply)
        name                      = "llm-server-dev"
      - resource_policies         = [] -> null
      ~ self_link                 = "https://www.googleapis.com/compute/v1/projects/local-llm-test-486215/zones/us-east4-c/instances/llm-server-dev" -> (known after apply)
        tags                      = [
            "dev",
            "spot-instance",
        ]
      ~ tags_fingerprint          = "z1mkJj1d5Gg=" -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ boot_disk {
          ~ auto_delete                = true -> false # forces replacement
          ~ device_name                = "persistent-disk-0" -> (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          ~ source                     = "https://www.googleapis.com/compute/v1/projects/local-llm-test-486215/zones/us-east4-c/disks/llm-server-dev" -> (known after apply)
            # (1 unchanged attribute hidden)

          ~ initialize_params {
              - enable_confidential_compute = false -> null
              ~ image                       = "https://www.googleapis.com/compute/v1/projects/debian-cloud/global/images/debian-12-bookworm-v20260114" -> "https://www.googleapis.com/compute/v1/projects/debian-cloud/global/images/debian-12-bookworm-v20260210" # forces replacement
              ~ labels                      = {} -> (known after apply)
              ~ provisioned_iops            = 0 -> (known after apply)
              ~ provisioned_throughput      = 0 -> (known after apply)
              - resource_manager_tags       = {} -> null
                # (2 unchanged attributes hidden)
            }
        }

      ~ network_interface {
          ~ internal_ipv6_prefix_length = 0 -> (known after apply)
          + ipv6_access_type            = (known after apply)
          + ipv6_address                = (known after apply)
          ~ name                        = "nic0" -> (known after apply)
          ~ network                     = "https://www.googleapis.com/compute/v1/projects/local-llm-test-486215/global/networks/llm-server-dev-vpc" -> "projects/local-llm-test-486215/global/networks/llm-server-dev-vpc"
          ~ network_ip                  = "10.0.1.3" -> (known after apply)
          - queue_count                 = 0 -> null
          ~ stack_type                  = "IPV4_ONLY" -> (known after apply)
          ~ subnetwork                  = "https://www.googleapis.com/compute/v1/projects/local-llm-test-486215/regions/us-east4/subnetworks/llm-subnet" -> "projects/local-llm-test-486215/regions/us-east4/subnetworks/llm-subnet"
          ~ subnetwork_project          = "local-llm-test-486215" -> (known after apply)
        }

      ~ scheduling {
          ~ instance_termination_action = "DELETE" -> "STOP"
          - min_node_cpus               = 0 -> null
            # (4 unchanged attributes hidden)
        }

      - scratch_disk { # forces replacement
          - device_name = "local-ssd-0" -> null
          - interface   = "NVME" -> null
          - size        = 375 -> null
        }
      - scratch_disk { # forces replacement
          - device_name = "local-ssd-1" -> null
          - interface   = "NVME" -> null
          - size        = 375 -> null
        }

      ~ service_account {
          ~ email  = "809219292662-compute@developer.gserviceaccount.com" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ instance_id   = "5392282377495038408" -> (known after apply)
  ~ internal_ip   = "10.0.1.3" -> (known after apply)
  ~ self_link     = "https://www.googleapis.com/compute/v1/projects/local-llm-test-486215/zones/us-east4-c/instances/llm-server-dev" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

**Checkov Security Scan:** success



*Pusher: @leonids2005, Action: `pull_request`*